Res-container-set-v6/container_t_10_c_30_frontCore_4_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4782.668ms, rate sampling interval: 17121ms
  Thread calibration: mean lat.: 4663.168ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4663.389ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 4639.394ms, rate sampling interval: 16416ms
  Thread calibration: mean lat.: 4662.843ms, rate sampling interval: 16662ms
  Thread calibration: mean lat.: 4364.441ms, rate sampling interval: 15794ms
  Thread calibration: mean lat.: 4693.910ms, rate sampling interval: 16842ms
  Thread calibration: mean lat.: 4775.569ms, rate sampling interval: 17121ms
  Thread calibration: mean lat.: 4789.056ms, rate sampling interval: 17104ms
  Thread calibration: mean lat.: 4703.048ms, rate sampling interval: 16793ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.35s     7.34s   44.04s    73.22%
    Req/Sec   832.71      7.68   844.00     70.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.14s 
 75.000%   23.84s 
 90.000%   31.31s 
 99.000%   44.04s 
 99.900%    0.86m 
 99.990%    0.87m 
 99.999%    0.87m 
100.000%    0.87m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8224.767     0.000000            1         1.00
   13606.911     0.100000        41716         1.11
   15761.407     0.200000        83395         1.25
   17055.743     0.300000       124926         1.43
   18530.303     0.400000       166547         1.67
   20135.935     0.500000       208562         2.00
   20905.983     0.550000       229014         2.22
   21676.031     0.600000       249907         2.50
   22380.543     0.650000       271178         2.86
   22970.367     0.700000       291572         3.33
   23838.719     0.750000       312435         4.00
   24559.615     0.775000       322755         4.44
   26574.847     0.800000       333098         5.00
   27934.719     0.825000       343598         5.71
   28852.223     0.850000       353987         6.67
   29868.031     0.875000       364348         8.00
   30588.927     0.887500       369535         8.89
   31309.823     0.900000       374798        10.00
   32243.711     0.912500       379951        11.43
   33128.447     0.925000       385145        13.33
   34471.935     0.937500       390405        16.00
   35323.903     0.943750       393021        17.78
   36175.871     0.950000       395607        20.00
   37093.375     0.956250       398208        22.86
   38109.183     0.962500       400763        26.67
   39485.439     0.968750       403412        32.00
   39944.191     0.971875       404690        35.56
   40468.479     0.975000       405957        40.00
   41156.607     0.978125       407287        45.71
   41811.967     0.981250       408587        53.33
   42532.863     0.984375       409864        64.00
   42926.079     0.985938       410557        71.11
   43417.599     0.987500       411166        80.00
   43778.047     0.989062       411822        91.43
   44466.175     0.990625       412463       106.67
   46497.791     0.992188       413110       128.00
   47579.135     0.992969       413434       142.22
   48562.175     0.993750       413760       160.00
   49119.231     0.994531       414087       182.86
   49512.447     0.995313       414426       213.33
   49807.359     0.996094       414751       256.00
   50102.271     0.996484       414895       284.44
   50397.183     0.996875       415070       320.00
   50593.791     0.997266       415227       365.71
   50888.703     0.997656       415409       426.67
   51118.079     0.998047       415572       512.00
   51183.615     0.998242       415645       568.89
   51281.919     0.998437       415733       640.00
   51347.455     0.998633       415803       731.43
   51445.759     0.998828       415878       853.33
   51544.063     0.999023       415972      1024.00
   51576.831     0.999121       415995      1137.78
   51642.367     0.999219       416043      1280.00
   51707.903     0.999316       416089      1462.86
   51740.671     0.999414       416118      1706.67
   51806.207     0.999512       416165      2048.00
   51838.975     0.999561       416191      2275.56
   51871.743     0.999609       416219      2560.00
   51871.743     0.999658       416219      2925.71
   51904.511     0.999707       416244      3413.33
   51937.279     0.999756       416265      4096.00
   51970.047     0.999780       416287      4551.11
   51970.047     0.999805       416287      5120.00
   51970.047     0.999829       416287      5851.43
   52002.815     0.999854       416303      6826.67
   52035.583     0.999878       416318      8192.00
   52035.583     0.999890       416318      9102.22
   52035.583     0.999902       416318     10240.00
   52068.351     0.999915       416334     11702.86
   52068.351     0.999927       416334     13653.33
   52068.351     0.999939       416334     16384.00
   52101.119     0.999945       416346     18204.44
   52101.119     0.999951       416346     20480.00
   52101.119     0.999957       416346     23405.71
   52101.119     0.999963       416346     27306.67
   52101.119     0.999969       416346     32768.00
   52133.887     0.999973       416358     36408.89
   52133.887     1.000000       416358          inf
#[Mean    =    21348.494, StdDeviation   =     7336.827]
#[Max     =    52101.120, Total count    =       416358]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  499049 requests in 1.00m, 206.36MB read
Requests/sec:   8317.82
Transfer/sec:      3.44MB